const interestsMap = {
    virtualization: [
      'Інженер з хмарних обчислень',
      'Системний адміністратор',
      'Інженер з віртуалізації'
    ],
    cloudArchitecture: [
      'Інженер з хмарних обчислень',
      'Хмарний архітектор',
      'Інженер з безпеки хмарних технологій',
      'Інженер з розгортання хмарних сервісів'
    ],
    cybersecurity: [
      'Інженер з безпеки хмарних технологій',
      'Інженер з мережевої інфраструктури'
    ],
    automation: [
      'Інженер з хмарних обчислень',
      'Інженер DevOps',
      'Інженер з автоматизації інфраструктури',
      'Інженер з віртуалізації',
      'Спеціаліст з моніторингу та продуктивності серверів',
      'Інженер з розгортання хмарних сервісів',
      'Архітектор CI/CD'
    ],
    databases: [
      'Адміністратор баз даних',
      'Фахівець з резервного копіювання і відновлення'
    ],
    networking: [
      'Інженер з мережевої інфраструктури',
      'Інженер з підтримки серверів'
    ],
    monitoring: [
      'Системний адміністратор',
      'Інженер DevOps',
      'Інженер з безпеки хмарних технологій',
      'Адміністратор баз даних',
      'Спеціаліст з моніторингу та продуктивності серверів',
      'Інженер з підтримки серверів'
    ],
    infrastructure: [
      'Системний адміністратор',
      'Хмарний архітектор',
      'Інженер з автоматизації інфраструктури',
      'Інженер з віртуалізації',
      'Інженер з мережевої інфраструктури',
      'Спеціаліст з моніторингу та продуктивності серверів',
      'Інженер з підтримки серверів',
      'Фахівець з резервного копіювання і відновлення',
      'Архітектор CI/CD'
    ],
    deployment: [
      'Хмарний архітектор',
      'Інженер DevOps',
      'Інженер з автоматизації інфраструктури',
      'Інженер з розгортання хмарних сервісів',
      'Архітектор CI/CD'
    ],
    backup: [
      'Адміністратор баз даних',
      'Фахівець з резервного копіювання і відновлення'
    ]
  };
  
  if (typeof module !== 'undefined' && module.exports) {
    module.exports = interestsMap;
  }
