[
  {
    "name": "Інженер з хмарних обчислень",
    "salary": "$40000-65000",
    "description": "Фахівець, який проектує, розробляє та підтримує хмарні рішення для забезпечення масштабованості, надійності та ефективності IT-інфраструктури. Відповідає за міграцію до хмари, оптимізацію ресурсів та забезпечення безпеки хмарних сервісів.",
    "career": [
      {
        "level": "Junior",
        "description": "Допомога у розгортанні базових хмарних рішень, моніторинг системи, виконання стандартних завдань з налаштування сервісів під керівництвом старших інженерів."
      },
      {
        "level": "Middle", 
        "description": "Самостійне проектування та впровадження хмарних архітектур середньої складності, оптимізація витрат, автоматизація процесів розгортання."
      },
      {
        "level": "Senior",
        "description": "Розробка складних мульти-хмарних рішень, керівництво командою, консультування з архітектури, впровадження найкращих практик безпеки та compliance."
      }
    ],
    "skills": [
      "AWS",
      "Azure",
      "Google Cloud Platform",
      "Docker",
      "Kubernetes",
      "Terraform",
      "Jenkins",
      "CI/CD",
      "Linux",
      "Python",
      "Bash",
      "Git"
    ]
  },
  {
    "name": "Системний адміністратор",
    "salary": "$28000-50000",
    "description": "Професіонал, відповідальний за встановлення, налаштування, підтримку та забезпечення стабільної роботи комп'ютерних систем, серверів та мережевої інфраструктури організації.",
    "career": [
      {
        "level": "Junior",
        "description": "Базове адміністрування систем, встановлення ПЗ, створення резервних копій, технічна підтримка користувачів."
      },
      {
        "level": "Middle",
        "description": "Управління серверами та мережами, налаштування безпеки, планування та виконання оновлень системи."
      },
      {
        "level": "Senior",
        "description": "Проектування IT-інфраструктури, стратегічне планування, керівництво командою адміністраторів, впровадження нових технологій."
      }
    ],
    "skills": [
      "Windows Server",
      "Linux",
      "Active Directory",
      "PowerShell",
      "VMware",
      "Hyper-V",
      "TCP/IP",
      "DNS",
      "DHCP",
      "Firewall",
      "Backup Solutions",
      "Monitoring Tools"
    ]
  },
  {
    "name": "Інженер з віртуалізації",
    "salary": "$35000-58000",
    "description": "Спеціаліст з проектування, впровадження та управління віртуальними інфраструктурами, що дозволяють оптимально використовувати апаратні ресурси та забезпечувати гнучкість IT-середовища.",
    "career": [
      {
        "level": "Junior",
        "description": "Розгортання віртуальних машин, базове налаштування гіпервізорів, моніторинг віртуального середовища."
      },
      {
        "level": "Middle",
        "description": "Проектування віртуальної інфраструктури, налаштування кластерів, забезпечення високої доступності та відмовостійкості."
      },
      {
        "level": "Senior",
        "description": "Розробка стратегії віртуалізації підприємства, інтеграція з хмарними рішеннями, керівництво проектами міграції."
      }
    ],
    "skills": [
      "VMware vSphere",
      "Microsoft Hyper-V",
      "Citrix XenServer",
      "KVM",
      "Docker",
      "Kubernetes",
      "SAN/NAS",
      "PowerShell",
      "Linux",
      "Windows Server",
      "Networking",
      "Storage"
    ]
  },
  {
    "name": "Хмарний архітектор",
    "salary": "$55000-90000",
    "description": "Провідний фахівець, який розробляє стратегію хмарних рішень, проектує складну архітектуру систем у хмарі та забезпечує відповідність бізнес-вимогам та технічним стандартам.",
    "career": [
      {
        "level": "Junior",
        "description": "Участь у проектуванні простих хмарних рішень, вивчення архітектурних паттернів та кращих практик."
      },
      {
        "level": "Middle",
        "description": "Самостійне проектування архітектури для середніх проектів, інтеграція різних хмарних сервісів."
      },
      {
        "level": "Senior",
        "description": "Розробка enterprise-архітектури, стратегічне планування хмарної трансформації, консультування C-level керівництва."
      }
    ],
    "skills": [
      "AWS Well-Architected Framework",
      "Azure Architecture",
      "Google Cloud Architecture",
      "Microservices",
      "API Design",
      "Terraform",
      "CloudFormation",
      "Docker",
      "Kubernetes",
      "DevOps",
      "Security",
      "Cost Optimization"
    ]
  },
  {
    "name": "Інженер з безпеки хмарних технологій",
    "salary": "$45000-75000",
    "description": "Фахівець з кібербезпеки, що спеціалізується на захисті хмарних інфраструктур, даних та додатків від кіберзагроз, забезпеченні compliance та реалізації політик безпеки.",
    "career": [
      {
        "level": "Junior",
        "description": "Моніторинг подій безпеки, налаштування базових політик доступу, участь у реагуванні на інциденти."
      },
      {
        "level": "Middle",
        "description": "Проектування архітектури безпеки, проведення аудитів, впровадження рішень для захисту даних."
      },
      {
        "level": "Senior",
        "description": "Розробка стратегії кібербезпеки, керівництво incident response team, консультування з compliance та регуляторних вимог."
      }
    ],
    "skills": [
      "AWS Security",
      "Azure Security Center",
      "IAM",
      "Zero Trust",
      "CISSP",
      "SIEM",
      "Vulnerability Assessment",
      "Penetration Testing",
      "Encryption",
      "Compliance (GDPR, SOC2)",
      "Incident Response",
      "Risk Assessment"
    ]
  },
  {
    "name": "Інженер з розгортання хмарних сервісів",
    "salary": "$38000-62000",
    "description": "Технічний спеціаліст, який забезпечує ефективне розгортання, налаштування та інтеграцію хмарних сервісів, автоматизує процеси деплойменту та забезпечує надійність додатків.",
    "career": [
      {
        "level": "Junior",
        "description": "Розгортання додатків за готовими інструкціями, базове налаштування CI/CD пайплайнів."
      },
      {
        "level": "Middle",
        "description": "Проектування процесів автоматизованого розгортання, налаштування моніторингу та логування."
      },
      {
        "level": "Senior",
        "description": "Розробка стратегії DevOps, впровадження advanced deployment practices, керівництво автоматизацією."
      }
    ],
    "skills": [
      "CI/CD",
      "Jenkins",
      "GitLab CI",
      "Docker",
      "Kubernetes",
      "Ansible",
      "Terraform",
      "AWS CodePipeline",
      "Azure DevOps",
      "Git",
      "Scripting",
      "Monitoring"
    ]
  },
  {
    "name": "Інженер з мережевої інфраструктури",
    "salary": "$35000-58000",
    "description": "Фахівець з проектування, налаштування та підтримки мережевої інфраструктури, включаючи локальні та глобальні мережі, забезпечення зв'язності та продуктивності мережі.",
    "career": [
      {
        "level": "Junior",
        "description": "Налаштування базового мережевого обладнання, моніторинг мережевого трафіку, технічна підтримка."
      },
      {
        "level": "Middle",
        "description": "Проектування мережевої архітектури, налаштування VPN, управління безпекою мережі."
      },
      {
        "level": "Senior",
        "description": "Стратегічне планування мережевої інфраструктури, інтеграція з хмарними рішеннями, керівництво мережевою командою."
      }
    ],
    "skills": [
      "Cisco",
      "Juniper",
      "TCP/IP",
      "OSPF",
      "BGP",
      "VPN",
      "VLAN",
      "Firewall",
      "Load Balancers",
      "Network Monitoring",
      "Wireshark",
      "Python"
    ]
  },
  {
    "name": "Інженер DevOps",
    "salary": "$42000-70000",
    "description": "Професіонал, який поєднує розробку та операційну діяльність для автоматизації процесів збірки, тестування та розгортання програмного забезпечення, забезпечуючи швидку та надійну доставку продуктів.",
    "career": [
      {
        "level": "Junior",
        "description": "Підтримка CI/CD пайплайнів, базова автоматизація, моніторинг додатків."
      },
      {
        "level": "Middle",
        "description": "Проектування DevOps процесів, впровадження Infrastructure as Code, налаштування контейнеризації."
      },
      {
        "level": "Senior",  
        "description": "Розробка DevOps стратегії, керівництво культурною трансформацією, впровадження advanced practices."
      }
    ],
    "skills": [
      "Docker",
      "Kubernetes",
      "Jenkins",
      "GitLab CI/CD",
      "Terraform",
      "Ansible",
      "AWS/Azure/GCP",
      "Linux",
      "Python",
      "Bash",
      "Git",
      "Monitoring"
    ]
  },
  {
    "name": "Інженер з автоматизації інфраструктури",
    "salary": "$40000-65000",
    "description": "Спеціаліст, який розробляє та впроваджує рішення для автоматизації управління IT-інфраструктурою, використовуючи код для забезпечення відтворюваності та масштабованості систем.",
    "career": [
      {
        "level": "Junior",
        "description": "Написання простих скриптів автоматизації, підтримка існуючих automation workflows."
      },
      {
        "level": "Middle",
        "description": "Розробка Infrastructure as Code рішень, автоматизація складних процесів деплойменту."
      },
      {
        "level": "Senior",
        "description": "Архітектура enterprise automation platforms, стратегічне планування автоматизації, керівництво командою."
      }
    ],
    "skills": [
      "Terraform",
      "Ansible",
      "Puppet",
      "Chef",
      "Python",
      "PowerShell",
      "Bash",
      "CloudFormation",
      "ARM Templates",
      "Git",
      "CI/CD",
      "API Integration"
    ]
  },
  {
    "name": "Спеціаліст з моніторингу та продуктивності серверів",
    "salary": "$32000-52000",
    "description": "Фахівець, що відповідає за постійний моніторинг серверних систем, аналіз продуктивності, виявлення проблем та оптимізацію роботи IT-інфраструктури для забезпечення максимальної доступності сервісів.",
    "career": [
      {
        "level": "Junior",
        "description": "Базовий моніторинг системних метрик, створення звітів, реагування на алерти."
      },
      {
        "level": "Middle",
        "description": "Налаштування комплексного моніторингу, аналіз трендів продуктивності, оптимізація систем."
      },
      {
        "level": "Senior",
        "description": "Розробка стратегії моніторингу, впровадження предиктивної аналітики, керівництво командою моніторингу."
      }
    ],
    "skills": [
      "Prometheus",
      "Grafana",
      "Nagios",
      "Zabbix",
      "ELK Stack",
      "Splunk",
      "New Relic",
      "DataDog",
      "Python",
      "SQL",
      "Linux",
      "Performance Tuning"
    ]
  },
  {
    "name": "Архітектор CI/CD",
    "salary": "$48000-78000",
    "description": "Провідний спеціаліст з проектування та впровадження систем безперервної інтеграції та доставки, що забезпечують ефективні процеси розробки, тестування та розгортання програмного забезпечення.",
    "career": [
      {
        "level": "Junior",
        "description": "Участь у налаштуванні CI/CD пайплайнів, підтримка існуючих процесів збірки."
      },
      {
        "level": "Middle",
        "description": "Проектування CI/CD процесів для окремих проектів, автоматизація тестування та деплойменту."
      },
      {
        "level": "Senior",
        "description": "Розробка enterprise CI/CD стратегії, впровадження advanced practices, консультування команд розробки."
      }
    ],
    "skills": [
      "Jenkins",
      "GitLab CI/CD",
      "Azure DevOps",
      "GitHub Actions",
      "TeamCity",
      "Docker",
      "Kubernetes",
      "Terraform",
      "Ansible",
      "Git",
      "Scripting",
      "Testing Frameworks"
    ]
  },
  {
    "name": "Адміністратор баз даних",
    "salary": "$35000-60000",
    "description": "Професіонал, відповідальний за встановлення, налаштування, підтримку та оптимізацію баз даних, забезпечення їх безпеки, продуктивності та доступності для бізнес-додатків.",
    "career": [
      {
        "level": "Junior",
        "description": "Базове адміністрування БД, створення резервних копій, моніторинг стану бази даних."
      },
      {
        "level": "Middle",
        "description": "Оптимізація запитів, налаштування реплікації, планування capacity, забезпечення безпеки."
      },
      {
        "level": "Senior",
        "description": "Архітектура database solutions, стратегічне планування, керівництво database team, disaster recovery."
      }
    ],
    "skills": [
      "SQL Server",
      "MySQL",
      "PostgreSQL",
      "Oracle",
      "MongoDB",
      "Redis",
      "SQL",
      "Database Design",
      "Performance Tuning",
      "Backup/Recovery",
      "Replication",
      "Security"
    ]
  },
  {
    "name": "Фахівець з резервного копіювання і відновлення",
    "salary": "$30000-48000",
    "description": "Спеціаліст, що забезпечує надійність та відновлюваність критично важливих даних організації через проектування, впровадження та підтримку систем резервного копіювання та disaster recovery.",
    "career": [
      {
        "level": "Junior",
        "description": "Виконання регулярних backup процедур, тестування відновлення, ведення документації."
      },
      {
        "level": "Middle",
        "description": "Проектування backup стратегій, автоматизація процесів, оптимізація storage utilization."
      },
      {
        "level": "Senior",
        "description": "Розробка enterprise backup and DR стратегії, планування business continuity, керівництво командою."
      }
    ],
    "skills": [
      "Veeam",
      "Commvault",
      "Acronis",
      "NetBackup",
      "AWS Backup",
      "Azure Backup",
      "Disaster Recovery",
      "Storage Technologies",
      "Scripting",
      "Linux/Windows",
      "Virtualization",
      "Cloud Backup"
    ]
  },
  {
    "name": "Інженер з підтримки серверів",
    "salary": "$28000-45000",
    "description": "Технічний фахівець, що забезпечує стабільну роботу серверної інфраструктури через моніторинг, обслуговування, діагностику та усунення проблем серверних систем організації.",
    "career": [
      {
        "level": "Junior",
        "description": "Базовий моніторинг серверів, реагування на алерти, виконання стандартних процедур обслуговування."
      },
      {
        "level": "Middle",
        "description": "Діагностика складних проблем, планування maintenance, оптимізація продуктивності серверів."
      },
      {
        "level": "Senior",
        "description": "Проектування server support strategies, керівництво технічною командою, планування capacity та upgrades."
      }
    ],
    "skills": [
      "Windows Server",
      "Linux",
      "Hardware Troubleshooting",
      "Virtualization",
      "Monitoring Tools",
      "PowerShell",
      "Bash",
      "RAID",
      "Network Protocols",
      "Remote Management",
      "Documentation",
      "ITIL"
    ]
  }
] 